<!DOCTYPE html>
<html>
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>Docker Workshop - Modifiser Docker</title>

    <link rel="stylesheet" href="/node_modules/bootstrap/dist/css/bootstrap.min.css">
    <link rel="stylesheet" href="/node_modules/font-awesome/css/font-awesome.min.css">
    <link rel="stylesheet" type="text/css" href="../style.css">

    <script src="/node_modules/jquery/dist/jquery.min.js"></script>
    <script src="/node_modules/bootstrap/dist/js/bootstrap.min.js"></script>


    <script type="text/javascript">
        $(document).ready(function () {
            $('#navigation').load('../navbar.html');

         /*   $('.task').each(function() {
                var $id = $(this).attr("id");
                var dataElem = {"task": $id};
                $.ajax({
                    url: '/check',
                    data: {
                        task: $id
                    }
                }).done(function(data) {
                    if(data === "korrekt") {
                        $('#' + $id).append('<span class="fa fa-check-circle"></span>');
                    } else {
                        $('#' + $id).append('<span class="fa fa-times-circle">'+data+'</span>');
                    }
                });
            });*/
        });
    </script>
</head>

<body>

<div class="nav-container">
    <div id="navigation" ></div>
</div>

<div class="container">
    <h1>Oppgave 2 - Modifisering av Dockerfile</h1>
    <p>
        Til n&aring; har vi bare brukt en veldig enkel dockerfil, som baserer seg p&aring; et eksisterende image,
        legger til en fil og deretter kj&oslash;rer denne ved oppstart. Det er mye mer man kan gj&oslash;re ved opprettelsen
        av images, og i denne oppgaven skal vi se p&aring; noen av dem.
    </p>
    <p>
        Hva som skal v&aelig;re inkludert i v&aring;rt ferdige docker-image kan styres ved &aring; forandre hvilket image vi baserer oss p&aring;.
        Hittil har vi basert dockerfilen v&aring;r p&aring; <a href="https://hub.docker.com/_/alpine/">Alpine</a>, som er en ekstremt
        nedstrippet linux-versjon. Dette er et default image som ofte brukes, og har fordelen at det gir sm&aring; containere
        med rask oppstartstid. Den mangler dog noen grunnleggende ting, som for eksempel Bash og Java.
    </p>
    <p>
        Merk at henting av image man baserer seg p&aring;, og installering av pakker, skjer under byggingen av imaget.
        Dette betyr at selve byggingen tar mer tid jo mer man gj&oslash;r, og i tillegg vil imaget ta mer lagringsplass. Oppstartstid av
        containeren blir ikke merkbart p&aring;virket av dette. Ting som derimot vil p&aring;virke oppstartstid er kj&oslash;ring av scripts,
        oppstart av applikasjoner etc.
    </p>

    <h2>a)</h2>
    <p>
        I Dockerfilen i mappen 'oppgave_2' legger vi scriptet 'checkJava.sh' til i containeren, og kj&oslash;rer dette p&aring; oppstart.
        Scriptet skal bare sjekke hvilken Java-versjon vi har. <b>Dette scriptet feiler forel&oslash;pig</b>, ettersom programmet Java ikke finnes
        i imaget vi baserer oss p&aring;.
    </p>
    <p>
        Bruk Dockers s&oslash;ke-kommando for &aring; finne det offisielle Java-imaget, som inneholder en JDK, og endre
        din Dockerfile slik at den baserer seg p&aring; den nyeste versjonen av dette. S&oslash;ke-kommandoen genererer
        en liste over matchende images fra Docker Hub. Det er ogs&aring; mulig &aring; g&aring; inn p&aring;
        <a href="https://hub.docker.com/">Docker Hub</a> og finne imaget der. Stjerner gir en indikasjon p&aring;
        hvor popul&aelig;rt et image er, og offisielle images har ogs&aring; en egen markering.
    </p>
    <p>
        Bygg og kj&oslash;r fra Dockerfile p&aring; nytt, denne gangen basert p&aring; Java, og se at scriptet n&aring; finner
        Java og skriver ut informasjonen fra 'java --version' n&aring;r containeren stater opp.
    </p>

    <h2>b)</h2>
    <p>
        Det er ogs&aring; mulig &aring; modifisere imaget man baserer seg p&aring; ved &aring; installere ekstra pakker.
        Bytt imaget Dockerfilen baserer seg p&aring; fra Java til Ubuntu, og bruk Ubuntus package manager APT via RUN-kommandoen
        i Dockerfile til &aring; installere pakken "curl" (se link nederst). Denne blir da installert under byggingen av imaget, og vil v&aelig;re
        tilgjengelig n&aring;r containeren startes. Endre ogs&aring; Dockerfilen slik at den kj&oslash;rer for eksempel 'curl -L checkip.dyndns.org'
        ved oppstart. Observer at curl n&aring; er installert og fungerer.
    </p>

    <div class="alert alert-info">
        Husk parameteren '-y' til apt-get install, ellers vil apt-get bli st&aring;ende &aring; vente p&aring; bruker-input,
        som det ikke er mulig &aring; fylle inn i Docker.
    </div>
    <div class="alert alert-danger">
        <b>NB:</b> dersom docker har problemer med tilkobling til repositories kan det i noen tilfeller hjelpe &aring; skru av VPN.
    </div>

    <h2>Nyttige lenker</h2>
    <ul>
        <li><a href="https://docs.docker.com/engine/userguide/containers/dockerimages/">Docker Docs - Images</a></li>
        <li><a href="https://docs.docker.com/engine/reference/builder/#cmd">Dockerfile - CMD</a></li>
        <li><a href="https://docs.docker.com/engine/userguide/eng-image/dockerfile_best-practices/">
            Dockerfile Best Practices (dekker ogs&aring; bruk av apt-get)</a></li>
    </ul>

</div>

</body>
</html>