<!DOCTYPE html>
<html>
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>Docker Workshop - Clouds</title>

    <link rel="stylesheet" href="/node_modules/bootstrap/dist/css/bootstrap.min.css">
    <link rel="stylesheet" href="/node_modules/font-awesome/css/font-awesome.min.css">
    <link rel="stylesheet" type="text/css" href="../style.css">

    <script src="/node_modules/jquery/dist/jquery.min.js"></script>
    <script src="/node_modules/bootstrap/dist/js/bootstrap.min.js"></script>
    <script type="text/javascript">
        $(document).ready(function() {
            $('#navigation').load('../navbar.html');

            $('.task').each(function() {
                var $id = $(this).attr("id");
                var dataElem = {"task": $id};
                $.ajax({
                    url: '/check',
                    data: { task: $id }
                }).done(function(data) {
                    $('#' + $id).append('<div>'+data+'</div>');
                });
            });
        });
    </script>
</head>

<body>

<div class="nav-container">
    <div id="navigation" ></div>
</div>

<div class="container">
    <h1>Oppgave 4 - To the Clouds!</h1>
    <p>
        Som nevnt i introen er en av fordelen med Docker containers er at de er "self-contained", at de har med seg alle
        avhengigheter som trengs for &aring; kj&oslash;re applikasjonen. Containere kan derfor (i teorien) kj&oslash;res overalt hvor
        docker er installert. Dette gj&oslash;r programmer bygget p&aring; Docker ekstremt portable. N&aring;r man har bygget et Docker image eksisterer det i det lokale docker-milj&oslash;et. Dersom man vil ha imaget p&aring; en fil
        kan man benytte Dockers save-kommando. Dette kan for eksempel v&aelig;re nyttig for &aring; flytte imaget fra en maskin til en annen,
        eller for &aring; deploye til en server.
    </p>


    <h2>a)</h2>
    <p>
        Lagre Docker imaget fra forrige oppgave til en aksesserbar fil.
    </p>

    <h2>b)</h2>
    <p>
        Overf&oslash;r denne filen til din utdelte Digital Ocean-server (be om en egen IP hvis du ikke allerede har f&aring;tt en).
        Alle servere har en bruker root, som kan autentiseres med en <a href="../workshop.ppk">SSH-n&oslash;kkel som lastes ned her</a>. Lagre filen
        lokalt, og last den inn i SSH. For &aring; gj&oslash;re det, s&aring; kan det v&aelig;re n&oslash;dvendig f&oslash;rst &aring; kj&oslash;re kommandoen
        'eval "$(ssh-agent -s)"'. Selve innlastingen skjer s&aring; med kommandoen 'ssh-add &lt;n&oslash;kkel&gt;'. Merk at p&aring;
        Windows og Mac har man SSH tilgjengelig i Docker Quickstart Terminal, der man ogs&aring; kj&oslash;rer alle docker-kommandoer.
        Filoverf&oslash;ringen kan gj&oslash;res med SCP, med f&oslash;lgende kommando: 'scp &lt;lagret image-fil&gt; root@&lt;server-ip&gt;:.'.
    </p>

    <h2>c)</h2>
    <p>
        SSH deg inn p&aring; serveren og last imaget inn i Docker-milj&oslash;et. NB: Her har vi v&aelig;rt snille og installert Docker for
        dere. Dette vil dere i andre sammenhenger selv m&aring;tte s&oslash;rge for er p&aring; plass.
    </p>
    <p>
        Har man s&oslash;rget for &aring; laste inn privat n&oslash;kkel fra b), s&aring; kan man logge seg p&aring; slik: 'ssh root@&lt;server-ip&gt;'.
    </p>

    <h2>d)</h2>
    <p>
        Kj&oslash;r deretter en container av imaget p&aring; serveren, p&aring; samme m&aring;te som i tidligere oppgaver (husk &aring; mappe portene p&aring;
        samme m&aring;te som i oppgave 3). Sjekk at containeren
        kj&oslash;rer ved &aring; g&aring; til http://&lt;server-ip&gt;:8080/test, og se at den skriver ut lagnavnet du spesifiserte i oppgave 3.
        Du har n&aring; prodsatt en docker-container p&aring; en server! Var ikke det fantastiskt enkelt og praktisk? <i>/ironi -
        det blir enklere!</i>
    </p>
    <div class="alert alert-info">
        Det finnes naturligvis verkt&oslash;y som hjelper til med slike oppgaver, men disse er ikke alltid s&aring; fleksible som
        man skulle &oslash;nske. Blant annet kan man fort havne i den situasjonen at kun utvikleren som f&oslash;rst deployet
        containere p&aring; en gitt server er den eneste som f&aring;r tilgang til dem senere - gitt at han/hun i det hele
        tatt fortsatt har samme maskin og Docker-installasjon lokalt!
    </div>

    <h2>Nyttige lenker</h2>
    <ul>
        <li><a href="https://docs.docker.com/engine/reference/commandline/save/">Docker save</a></li>
        <li><a href="https://docs.docker.com/engine/reference/commandline/load/">Docker load</a></li>
    </ul>

</div>


</body>
</html>