<!DOCTYPE html>
<html>
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>Docker Workshop - Databaser</title>

    <link rel="stylesheet" href="/node_modules/bootstrap/dist/css/bootstrap.min.css">
    <link rel="stylesheet" href="/node_modules/font-awesome/css/font-awesome.min.css">
    <link rel="stylesheet" type="text/css" href="../style.css">

    <script src="/node_modules/jquery/dist/jquery.min.js"></script>
    <script src="/node_modules/bootstrap/dist/js/bootstrap.min.js"></script>
    <script type="text/javascript">
        $(document).ready(function () {
            $('#navigation').load('../navbar.html');

           /* $('.task').each(function() {
                var $id = $(this).attr("id");
                var dataElem = {"task": $id};
                $.ajax({
                    url: '/check',
                    data: { task: $id }
                }).done(function(data) {
                    $('#' + $id).append('<div>'+data+'</div>');
                });
            });*/
        });
    </script>
</head>

<body>

<div class="nav-container">
    <div id="navigation"></div>
</div>

<div class="container">
    <h1>Oppgave 8 - Databaser</h1>
    <p>
        Det finnes ferdige images for databaser, og Docker Hub innneholder versjoner for de fleste popul&aelig;re dialekter
        som MySQL, PostgreSQL og MongoDB etc. Om ingen av imagene p&aring; Hub passer ens spesifikasjoner, eller man av andre
        grunner ikke &oslash;nsker &aring; bruke de offisielle imagene er det ogs&aring; fint mulig &aring; lage dem selv. To eksempler
        p&aring; dette er lenket under.
    </p>
    <p>
        For st&oslash;rre systemer kan det l&oslash;nne seg &aring; benytte mer avanserte l&oslash;sninger for data-volume managment i docker som f.eks
        <a href="https://clusterhq.com/flocker/introduction/">Flocker</a>.
    </p>

    <h2>a)</h2>
    <p>
        Bruk s&oslash;kekommandoen for &aring; finne det offisielle MySQL-imaget, og kj&oslash;r en container av dette imaget.
        Korrekt kommando for &aring; kj&oslash;re dette kan finnes p&aring; beskrivelsen av imaget p&aring; DockerHub (link nederst).
        Aksesser containeren ved &aring; starte bash i containeren med kommandoen 'docker exec -it &lt;container id&gt; bash',
        og derfra bruke MySQL-kommandoer. Opprett her en database, og fyll inn litt innhold.
    </p>
    <div class="alert alert-info">
        MySQL kommandoer:
        <ul>
            <li>'mysql -p' starter mysql i terminalen</li>
            <li>CREATE DATABASE &lt;db-navn&gt;</li>
            <li>SHOW DATABASES;</li>
            <li>USE &lt;db-navn&gt;</li>
            <li>CREATE TABLE &lt;table-navn&gt; (&lt;kolonnenavn&gt; &lt;datatype&gt;)  [datatype kan for eksempel v&aelig;re varchar(16)]</li>
        </ul>
    </div>

    <h2>b)</h2>
    <p>
        Docker-containere som kj&oslash;rer databaser er 'data volume containers'. Disse containerene eksponerer det lokale filsystemet,
        og gj&oslash;r det tilgjengelig for andre containere. Det betyr at selv om en container stoppes (og ogs&aring; om den slettes),
        vil selve databasen fortsatt v&aelig;re inntakt. Stop containeren og start den igjen, bruk samme kommandoer som i forrige oppgave
        for &aring; se at databasen fortsatt inneholder alle de samme dataene.
    </p>

    <h2>c)</h2>
    <p>
        N&aring;r lokasjon ikke konfigureres oppretter MySQL imaget databasene i en standard lokasjon (/var/lib/mysql).
        Sett isteden en selvvalgt mappe som lokasjon, og se at MySQL containeren oppretter de n&oslash;dvendige filene der n&aring;r
        den kj&oslash;res.
    </p>
    <div class="alert alert-warning">
        Husk det som ble nevnt ang. docker-machine og mounting av lokale mapper som volumer
        <a href="opg7_logging.html#mounting-tips">i forrige oppgave</a>! MySQL kan for &oslash;vrig komme til &aring; kreve
        at katalogen som mappes er tom i utgangspunktet.
    </div>

    <h2>Bonusoppgave</h2>
    <p>
        For at en database i en container skal v&aelig;re nyttig m&aring; den kunne aksesseres. Det er flere m&aring;ter &aring; gj&oslash;re dette p&aring;,
        men den enkleste er &aring; aksessere den via ip-addressen til hosten den kj&oslash;rer p&aring;. Kj&oslash;r en container av MySQL, og map
        containerens MySQL-port (3306) til en port p&aring; hosten. Test at du kan n&aring; databasen ved &aring; koble p&aring; fra en terminal
        fra din pc, med en kommando p&aring; formen 'mysql -u &ltbruker&gt -p -h &lt;ip-en til <strong>docker-hosten</strong>&gt'. Alternativt kan du
        bruke et hvilket som helst MySQL-verkt&oslash;y for &aring; koble p&aring;.
    </p>

    <h3>Avsluttende tips</h3>
    <div>
        Dersom du vil rydde opp i filene Docker har laget, se tipset p&aring; <a href="../installasjon.html#opprydding">installasjonssiden</a>.
    </div>

    <h2>Nyttige lenker:</h2>
    <ul>
        <li><a href="https://hub.docker.com/_/mysql/">Docker Hub - MySQL</a></li>
        <li><a href="https://docs.docker.com/engine/userguide/containers/dockervolumes/">Docker Docs - Volumes</a></li>
        <li><a href="https://docs.docker.com/engine/examples/postgresql_service/">Dockerizing PostgreSQL</a></li>
        <li><a href="https://docs.docker.com/engine/examples/mongodb/">Dockerizing MongoDB</a> </li>
    </ul>

</div>

</body>
</html>